### 1.[] 이용하기
- [] 하나: 시리즈 반환
- [[]] 이중 대괄호: 데이터프레임 반환
- 복합 조건시 각 조건을 ()로 감싸고 &, | 사용
- 조건부 추출 후 열 선택은 연속으로 [] 사용 가능

In [1]:
import pandas as pd
df_raw = pd.read_csv('exam.csv')
df = df_raw.head(10)
df

   id  nclass  front  back  design
0   1       1     50    98      50
1   2       1     60    97      60
2   3       1     45    86      78
3   4       1     30    98      58
4   5       2     25    80      65
5   6       2     50    89      98
6   7       2     80    90      45
7   8       2     90    78      25
8   9       3     20    98      15
9  10       3     50    98      45

In [2]:
# nclass 추출
df['nclass']

0    1
1    1
2    1
3    1
4    2
5    2
6    2
7    2
8    3
9    3
Name: nclass, dtype: int64

In [3]:
#nclass가 1인지 확인
df['nclass'] == 1

0     True
1     True
2     True
3     True
4    False
5    False
6    False
7    False
8    False
9    False
Name: nclass, dtype: bool

In [4]:
# nclass가 1이면 추출
df[df['nclass'] == 1]

   id  nclass  front  back  design
0   1       1     50    98      50
1   2       1     60    97      60
2   3       1     45    86      78
3   4       1     30    98      58

In [5]:
# 프론트 점수가 80점 이상이면 추출
df[df['front'] >= 80]

   id  nclass  front  back  design
6   7       2     80    90      45
7   8       2     90    78      25

In [6]:
# nclass가 1이면서 프론트 점수가 50점 이상
df[(df['nclass'] == 1) & (df['front'] >= 50)]

   id  nclass  front  back  design
0   1       1     50    98      50
1   2       1     60    97      60

In [7]:
# 프론트 점수가 50점 미만이거나 백 점수가 50점 미만
df[(df['front'] < 50) | (df['back'] < 50)]

   id  nclass  front  back  design
2   3       1     45    86      78
3   4       1     30    98      58
4   5       2     25    80      65
8   9       3     20    98      15

In [8]:
df['id']

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: id, dtype: int64

In [9]:
df['nclass']

0    1
1    1
2    1
3    1
4    2
5    2
6    2
7    2
8    3
9    3
Name: nclass, dtype: int64

In [10]:
# 여러 변수를 동시에 추출
df[['id', 'nclass']]

   id  nclass
0   1       1
1   2       1
2   3       1
3   4       1
4   5       2
5   6       2
6   7       2
7   8       2
8   9       3
9  10       3

In [11]:
# 시리즈로 추출
df['id']

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: id, dtype: int64

In [12]:
# 데이터 프레임으로 추출
df[['id']]

   id
0   1
1   2
2   3
3   4
4   5
5   6
6   7
7   8
8   9
9  10

In [13]:
# nclass가 1인 행의 프론트열
df[df['nclass'] == 1]['front']

0    50
1    60
2    45
3    30
Name: front, dtype: int64

In [14]:
#nclass가 1인 행의 프론트, 백 열
df[df['nclass'] == 1][['front', 'back']]

   front  back
0     50    98
1     60    97
2     45    86
3     30    98

In [16]:
# pandas 함수만 사용
df.groupby('nclass')\
    .agg(front =('front','mean'),
         back =('back','mean'))

        front   back
nclass
1       46.25  94.75
2       61.25  84.25
3       35.00  98.00

In [17]:
# pandas 함수와 [] 함께 사용
df.groupby('nclass')[['front', 'back']].mean()

        front   back
nclass
1       46.25  94.75
2       61.25  84.25
3       35.00  98.00